DataProcessors/ЖурналУчетаОригиналовПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>ЖурналУчетаОригиналовПервичныхДокументов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/гф_ОтслеживаемыеОригиналыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>гф_ОтслеживаемыеОригиналыПервичныхДокументов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЖурналУчетаОригиналовПервичныхДокументов/Forms/СписокДокументовПечать/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТипыДокументов = Новый Массив;
	
	Для Каждого Документ Из Параметры.МассивДокументов Цикл
		
		ТипДокумента = Документ.Метаданные().Имя;
		
		Если ТипыДокументов.Найти(ТипДокумента) = Неопределено Тогда
			
			ТипыДокументов.Добавить(ТипДокумента);
			
			НоваяСтрокаТипов = ТаблицаТиповДокументов.Добавить();
			
			НоваяСтрокаТипов.ТипДокумента = ТипДокумента;
			
		КонецЕсли;	
		
		НоваяСтрокаДокументов = ТаблицаДокументов.Добавить();
		
		НоваяСтрокаДокументов.Документ		= Документ;
		НоваяСтрокаДокументов.ТипДокумента	= ТипДокумента;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти       

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрыПечати = УправлениеПечатьюКлиент.ПараметрыПечати();
	
	ПечатьНаСервере(ПараметрыПечати);
	
	Возврат;
	
	Для Каждого СтрокаТипа Из ТаблицаТиповДокументов Цикл
		
		ОтборПечатныхФорм = Новый Структура;
		
		ОтборПечатныхФорм.Вставить("ТипДокумента", СтрокаТипа.ТипДокумента);
		
		ОтборПечатныхФорм.Вставить("Пометка", Истина);
		
		НайденныеПечатныеФормы = ПечатныеФормы.НайтиСтроки(ОтборПечатныхФорм);
		
		Если Не НайденныеПечатныеФормы.Количество() Тогда
			
			Продолжить;	
			
		КонецЕсли;
		
		Идентификаторы = "";
		
		Для Каждого ПечатнаяФорма Из НайденныеПечатныеФормы Цикл
			
			Если ПечатнаяФорма.Пометка Тогда
				
				Идентификаторы = ?(Идентификаторы = "", ПечатнаяФорма.ПечатнаяФорма, Идентификаторы + "," + ПечатнаяФорма.ПечатнаяФорма);
				
			КонецЕсли;	
			
		КонецЦикла;	  
		
		ДокументыНаПечать = Новый Массив;
		
		ОтборДокументов = Новый Структура;
		
		ОтборДокументов.Вставить("ТипДокумента", СтрокаТипа.ТипДокумента);
		
		НайденныеДокументы = ТаблицаДокументов.НайтиСтроки(ОтборДокументов);
		
		ДокументыНаПечать = Новый Массив;
		
		Для Каждого НайденныйДокумент Из НайденныеДокументы Цикл
			
			ДокументыНаПечать.Добавить(НайденныйДокумент.Документ);
			
		КонецЦикла;	   
		
		ПараметрыПечати = УправлениеПечатьюКлиент.ПараметрыПечати();
		
		//КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификаторы);
		
		//УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ДокументыНаПечать, ПараметрыПечати);
		
	КонецЦикла;	
	
	
	
	//ДокументыНаПечать = Новый Массив;
	//
	//Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
	//	
	//	ДокументыНаПечать.Добавить(СтрокаТаблицы.Документ);
	//	
	//КонецЦикла;	   
	//
	//ПараметрыПечати = УправлениеПечатьюКлиент.ПараметрыПечати();
	//
	//КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификаторы);
	//
	//УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ДокументыНаПечать, ПараметрыПечати);
	
	
	//Если Команда.Имя = "ПечатьНаПринтер" Тогда
	//	
	//	УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ." + ТипДокумента, Идентификаторы, ДокументыНаПечать, ПараметрыПечати);
	//	
	//Иначе	
	//	
	//	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ." + ТипДокумента, Идентификаторы, ДокументыНаПечать, ЭтотОбъект, ПараметрыПечати);
	//	
	//КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ПараметрыПечати)
	
	Для Каждого СтрокаТипа Из ТаблицаТиповДокументов Цикл
		
		ОтборПечатныхФорм = Новый Структура;
		
		ОтборПечатныхФорм.Вставить("ТипДокумента", СтрокаТипа.ТипДокумента);
		
		ОтборПечатныхФорм.Вставить("Пометка", Истина);
		
		НайденныеПечатныеФормы = ПечатныеФормы.НайтиСтроки(ОтборПечатныхФорм);
		
		Если Не НайденныеПечатныеФормы.Количество() Тогда
			
			Продолжить;	
			
		КонецЕсли;
		
		Идентификаторы = "";
		
		Для Каждого ПечатнаяФорма Из НайденныеПечатныеФормы Цикл
			
			Если ПечатнаяФорма.Пометка Тогда
				
				Идентификаторы = ?(Идентификаторы = "", ПечатнаяФорма.ПечатнаяФорма, Идентификаторы + "," + ПечатнаяФорма.ПечатнаяФорма);
				
			КонецЕсли;	
			
		КонецЦикла;	  
		
		ДокументыНаПечать = Новый Массив;
		
		ОтборДокументов = Новый Структура;
		
		ОтборДокументов.Вставить("ТипДокумента", СтрокаТипа.ТипДокумента);
		
		НайденныеДокументы = ТаблицаДокументов.НайтиСтроки(ОтборДокументов);
		
		ДокументыНаПечать = Новый Массив;
		
		Для Каждого НайденныйДокумент Из НайденныеДокументы Цикл
			
			ДокументыНаПечать.Добавить(НайденныйДокумент.Документ);
			
		КонецЦикла;	   
		
		УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(Идентификаторы);
		
		ИмяМенеджераПечати = "";
		
		Результат = УправлениеПечатью.СформироватьПечатныеФормы(ИмяМенеджераПечати, 
																Идентификаторы, 
																ДокументыНаПечать, 
																ПараметрыПечати);
		
	КонецЦикла;	
	
	
	
	//ДокументыНаПечать = Новый Массив;
	//
	//Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
	//	
	//	ДокументыНаПечать.Добавить(СтрокаТаблицы.Документ);
	//	
	//КонецЦикла;	   
	//
	//ПараметрыПечати = УправлениеПечатьюКлиент.ПараметрыПечати();
	//
	//КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификаторы);
	//
	//УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ДокументыНаПечать, ПараметрыПечати);
	
	
	//Если Команда.Имя = "ПечатьНаПринтер" Тогда
	//	
	//	УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ." + ТипДокумента, Идентификаторы, ДокументыНаПечать, ПараметрыПечати);
	//	
	//Иначе	
	//	
	//	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ." + ТипДокумента, Идентификаторы, ДокументыНаПечать, ЭтотОбъект, ПараметрыПечати);
	//	
	//КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти       

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Заполняет таблицу доступных печатных форм
Процедура ЗаполнитьТаблицуПечатныхФорм() 
	
	ТаблицаТипов = ТаблицаТиповДокументов.Выгрузить(,"ТипДокумента");
	
	ТипыДокументов = ТаблицаТипов.ВыгрузитьКолонку("ТипДокумента");
	
	ПечатныеФормы.Очистить();
	
	Если Не ТипыДокументов.Количество() Тогда
		
		Возврат;
		
	КонецЕсли;		
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|	гф_ОтслеживаемыеОригиналыПервичныхДокументов.ВидДокумента КАК ВидДокумента,
	|	гф_ОтслеживаемыеОригиналыПервичныхДокументов.ПервичныйДокумент КАК ПервичныйДокумент,
	|	гф_ОтслеживаемыеОригиналыПервичныхДокументов.ПредставлениеПервичногоДокумента КАК ПредставлениеПервичногоДокумента,
	|	ИдентификаторыОбъектовМетаданных.Имя
	|ИЗ
	|	РегистрСведений.гф_ОтслеживаемыеОригиналыПервичныхДокументов КАК гф_ОтслеживаемыеОригиналыПервичныхДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО гф_ОтслеживаемыеОригиналыПервичныхДокументов.ВидДокумента = ИдентификаторыОбъектовМетаданных.Ссылка
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Имя В (&ТипыДокументов)";
	
	Запрос.Параметры.Вставить("ТипыДокументов", ТипыДокументов);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДоступныеФормы = Результат.Выгрузить();

	Для Каждого ДоступнаяФорма Из ДоступныеФормы Цикл 
		
		ОтборСтрок = Новый Структура;
		
		ОтборСтрок.Вставить("ПечатнаяФорма", ДоступнаяФорма.ПервичныйДокумент);
		ОтборСтрок.Вставить("ТипДокумента", ДоступнаяФорма.Имя);
		
		НайденныеСтроки = ВыбранныеПечатныеФормы.НайтиСтроки(ОтборСтрок);
		
		Пометка = НайденныеСтроки.Количество() > 0;
		
		ПредставлениеПервичногоДокумента = ДоступнаяФорма.ПредставлениеПервичногоДокумента 
											+ " ("
											+ ДоступнаяФорма.ВидДокумента.Синоним
											+ ")";
											
		ПечатнаяФорма = ПечатныеФормы.Добавить();
		
		ПечатнаяФорма.ПечатнаяФорма	= ДоступнаяФорма.ПервичныйДокумент;
		ПечатнаяФорма.ТипДокумента	= ДоступнаяФорма.Имя;
		ПечатнаяФорма.Пометка		= Пометка;
		ПечатнаяФорма.Представление	= ПредставлениеПервичногоДокумента;
											
	КонецЦикла;	 
	
КонецПроцедуры// } #wortmann

&НаКлиенте
// Добавляет или удаляет строки из сохраняемой в настройках таблицы ВыбранныеПечатныеФормы
Процедура ПечатныеФормыПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПечатныеФормы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	ОтборСтрок = Новый Структура;
	
	ОтборСтрок.Вставить("ПечатнаяФорма", ТекущиеДанные.ПечатнаяФорма);
	ОтборСтрок.Вставить("ТипДокумента", ТекущиеДанные.ТипДокумента);
		
	НайденныеСтроки = ВыбранныеПечатныеФормы.НайтиСтроки(ОтборСтрок);
	
	Если ТекущиеДанные.Пометка Тогда
		
		Если Не НайденныеСтроки.Количество() Тогда
			
			НоваяФорма = ВыбранныеПечатныеФормы.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяФорма, ТекущиеДанные);
			
		КонецЕсли;
		
	Иначе	
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Индекс = ВыбранныеПечатныеФормы.Индекс(НайденнаяСтрока);
			
			ВыбранныеПечатныеФормы.Удалить(Индекс);
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ЗаполнитьТаблицуПечатныхФорм();
	
КонецПроцедуры

#КонецОбласти
